/*题面描述：
曼琪很喜欢研究数字规律。她发现有一些数值平方后会有一种奇怪的现象，她把会出现这种现象的数叫“同构数”。“同构数”是指这样的一种数，这种数会出现在它的平方数的右端。如5是25右边的数，25是625右边的数，5和25都是同构数。曼琪觉得这些数并不止一两个，你能帮她找出给定范围内的全部同构数吗？
输入：
两个整数，为给定的数据范围m和n，包括m和n。

输出：
在单行中输出m和n之间的全部同构数，从小到大依次排列，注意每个数的后面都有一个空格。

示例输入：
5 2

示例输出：
5*/
#include <stdio.h>
int main(void)
{
    long long m, n, i, a;
    scanf("%lld %lld", &m, &n);
    if (m >= n)
    {
        a = m;
        m = n;
        n = a;
    }
    for (i = m; i <= n; i++)
    {
        long long k = i;
        long long p = 10;
        while (k >= 10)
        {
            k = k / 10;
            p = p * 10;
        }
        if ((1LL * i * i - i) % p == 0)
        {
            printf("%lld ", i);
        }
    }
    printf("\n");
    return 0;
}
/*1.学会了在一个变量前面乘以"1LL"（long long类型的1），把变量转换成long long类型，防止溢出。
  2.学会了判断变量位数的方法*/