/*题面描述：
e(指自然底数e)与圆周率π被认为是数学中最重要的两个超越数（不满足任何整系数代数方程的数，称超越数）。而且e、π与虚数i三者之间有一个相当有名的关系式：e (iπ)=－1。通常我们可以通过公式e=1+1/1!+1/2!+1/3!+…计算到它前n项或到某一项小于规定值作为近似值。试计算e的值计算到前n项。
e.png
输入：
指定的项数n。

输出：
输出e的近似值，小数点后保留八位小数。

示例输入：
2

示例输出：
2.50000000*/
/*第一版：#include <stdio.h>
int main()
{
    int n, i, k;
    double t = 1.0,g;
    scanf("%d", &n);
    for (i = 1; i <= n; i++)
    {
        int s=1;
        for (k = 1; k <= i; k++)
        {
           s=s*k;
           g=s;
        }
        t += 1/g;
    }
    printf("%.8lf\n", t);
    return 0;
}*/
#include <stdio.h>
int main()
{
    int n, i;
    double t = 1.0, s = 1.0;
    scanf("%d", &n);
    for (i = 1; i <= n; i++)
    {

        s = s * i;
        t += 1 / s;
    }
    printf("%.8lf\n", t);
    return 0;
}
/*1.学会了要求分数1/s必须要s是浮点型，否则结果就会被截断输出0
2.学会了在嵌套循环时想一想两个循环之间是否有可以反复利用后的值？可不可以化简为一个循环？
否则在嵌套循环时复杂度就是原来的n次方。
3.学会了再修改时把一个模块单独拉出来，验证是不是其出了问题*/