/*古罗马时期，《高卢战记》有描述恺撒曾经使用密码来传递信息，即所谓的“恺撒加密术”，它是一种循环替代密码，大小写字母各构成一个环。如图所示，对于信件中的每个字母，会用它后面的第t个字母代替。例如当t=4时，“China”加密的规则是用原来字母后面第4个字母代替原来的字母，即字母“A”后面第4个字母是“E”，用“E”代替“A”。因此，“China”应译为“Glmre”。请编写一程序可将任意输入的5个字符加密（用它后面的第t个字母代替）。
加密
输入：
第一行输入五个英文字符，以空格间隔。
第二行输入一个整数t。

输出：
输出加密后的字符，字符之间无需空格间隔。

示例输入：
C h i n a
4

示例输出：
Glmre*/
#include <stdio.h>
int main(void)
{
    char s[5];
    int t, i;
    for (i = 0; i < 5; i++)
    {
        scanf(" %c", &s[i]);
    }
    scanf("%d", &t);
    for (i = 0; i < 5; i++)
    {
        if (s[i] + t >= 91 && s[i] + t <= 96)
            s[i] -= (26 - t);
        else if (s[i] + t >= 123)
            s[i] -= (26 - t);
        else
            s[i] += t;
    }
    for (i = 0; i < 5; i++)
    {
        printf("%c", s[i]);
    }
    printf("\n");
    return 0;
}
/*通过这道题，我学到了1.可以通过" (空格)%s"让读取前先跳过任意数量的空白字符，使其不会读入键盘输入的空格
                    2.花括号内定义的新变量到外面就无效了
                    3.巩固了数组和循环的用法  */