/*现输入一个真分数，请将该分数分解为埃及分数。如：8/11=1/2+1/5+1/55+1/110。
一种解决方法是：若真分数a/b中的分子a能整除分母b，则真分数经过化简直接就可以得到埃及分数，否则若真分数的分子不
能整除分母，则可以从原来的分数中分解出一个分母c=b/a+1的埃及分数。
分解后剩下的部分形成一个新的a/b，即a=a×c－b，b=b×c。继续用这种方法将剩余部分反复分解，最后可得到结果。
输入：
标准输入，两个整数，表示分子和分母。
输出：
标准输出，输出分解后的埃及分数（按分母递增的顺序）。
示例输入：
8 11
示例输出：
1/2+1/5+1/37+1/4070
提示：
请严格按题面描述的算法分解并按顺序输出。不同的分解算法可能得到的结果不同，
但都是正确的，如8/11还可以分解为：1/2+1/5+1/55+1/110。*/
#include <stdio.h>
int main(void)
{
    int a, b, c;
    scanf("%d %d", &a, &b);
    while (b % a != 0)
    {
        c = b / a + 1;
        a = a * c - b;
        b = b * c;
        printf("%d/%d+", 1, c);

        
    }
    if (b % a == 0)
        {
         printf("%d/%d\n", 1,b/a);
         }
    return 0;
}