/*题面描述：
修罗王在恐怖的冥域中找到了传说中的不死秘术，为了安全起见，他对一对刚出生的小兔子施展了此秘术，现在假设秘术使得所有的兔子都不死，而兔子在出生两个月后，就有繁殖能力，那么若干个月后可以繁殖多少对兔子？
如图所示：第一个月小兔子没有繁殖能力，所以还是一对； 两个月后，生下一对小兔后总数共有两对；三个月以后，老兔子又生下一对，因为小兔子还没有繁殖能力，所以一共是三对； ……

rabit.png
输入：
一个正整数n，n<=100，表示第n个月。

输出：
该月份兔子的总对数。

示例输入：
3

示例输出：
2*/
#include<stdio.h>
int main(void)
{int n,i;
unsigned long long low[101],high[101];
high[1]=0;
high [2]=0;
low[1]=1;
low[2]=1;
scanf("%d",&n);
for(i=3;i<=n;i++)
    {low[i]=low[i-1]+low[i-2];
     high[i]=high[i-1]+high[i-2];
     if (low[i]>=1000000000)
        {
            low[i]-=1000000000;
            high[i]++;
        }
    }
if(high[n]==0)
    printf("%llu",low[n]);
else
    printf("%llu%09llu",high[n],low[n]);
return 0;

}
/*学会了用高精度加法处理大到无法正常存放的数，学会了%09lld这个09表示不足9位的数前面补零补到9位输出*/